Documents/ПоступлениеНаСчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>ПоступлениеНаСчет</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДенежныеСредства</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыПоЛьготам</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыПоСубсидиям</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыПоЛицевымСчетам</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыПоРегиональнымСубсидиям</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>БанковскийСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийПоступлениеНаСчет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасшифровкаПлатежаСписком</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНачисления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНачислений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РасшифровкаПлатежа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МесяцНачисления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПризнакАванса</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ДенежныеСредства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<AccumulationRegister>
		<Properties>
			<Name>ДенежныеСредства</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>БанковскийСчетКасса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ВидыОперацийПоступлениеНаСчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ВидыОперацийПоступлениеНаСчет</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОтЛицевогоСчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетыПоСубсидиям</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетыПоЛьготам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетыПоРегиональнымСубсидиям</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеПоступления</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ТипыДенежныхСредств</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Наличные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Безналичные</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ПоступлениеНаСчет/Ext/ManagerModule.bsl
// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицуРасчетыПоЛицевымСчетам(ДокументСсылкаПоступлениеНаСчет, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		|	ВременнаяТаблицаРасшифровкаПлатежа.Период,
		|	ВременнаяТаблицаРасшифровкаПлатежа.Организация,
		|	ВременнаяТаблицаРасшифровкаПлатежа.ЛицевойСчет,
		|	ВременнаяТаблицаРасшифровкаПлатежа.Услуга,
		|	ВременнаяТаблицаРасшифровкаПлатежа.Сумма,
		|	ВременнаяТаблицаРасшифровкаПлатежа.МесяцНачисления,
		|	ВременнаяТаблицаРасшифровкаПлатежа.ВидОперации,
		|	ВременнаяТаблицаРасшифровкаПлатежа.ВидНачисления
		|ИЗ
		|	ВременнаяТаблицаРасшифровкаПлатежа КАК ВременнаяТаблицаРасшифровкаПлатежа
		|ГДЕ
		|	ВременнаяТаблицаРасшифровкаПлатежа.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоступлениеНаСчет.ОтЛицевогоСчета)";	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыПоЛицевымСчетам", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицуРасчетыПоЛицевымСчетам()


// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицуДенежныеСредства(ДокументСсылкаПоступлениеНаСчет, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		|	ВременнаяТаблицаШапка.Период,
		|	ВременнаяТаблицаШапка.Организация,
		|	ВременнаяТаблицаШапка.БанковскийСчет КАК БанковскийСчетКасса,
		|	ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.БезНаличные) КАК ТипДенежныхСредств,		
		|	ВременнаяТаблицаШапка.СуммаДокумента КАК Сумма
		|ИЗ
		|	ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДенежныеСредства", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицуДенежныеСредства()


// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаВзаиморасчетыПоЛьготам(ДокументСсылкаПоступлениеНаСчет, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		|	ВременнаяТаблицаШапка.Период КАК Период,
		|	ВременнаяТаблицаШапка.Организация КАК Организация,
		|	ВременнаяТаблицаШапка.Контрагент КАК Контрагент,
		|	ВременнаяТаблицаШапка.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	ВременнаяТаблицаШапка.СуммаДокумента КАК Сумма,
		|	ВременнаяТаблицаШапка.Услуга КАК Услуга,
		|	ВременнаяТаблицаШапка.ВидОперации
		|ИЗ
		|	ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|ГДЕ
		|	ВременнаяТаблицаШапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоступлениеНаСчет.РасчетыПоЛьготам)";	
		
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаВзаиморасчетыПоЛьготам", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаВзаиморасчетыПоЛьготам()


// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаВзаиморасчетыПоСубсидиям(ДокументСсылкаПоступлениеНаСчет, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		|	ВременнаяТаблицаШапка.Период КАК Период,
		|	ВременнаяТаблицаШапка.Организация КАК Организация,
		|	ВременнаяТаблицаШапка.Контрагент КАК Контрагент,
		|	ВременнаяТаблицаШапка.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	ВременнаяТаблицаШапка.СуммаДокумента КАК Сумма,
		|	ВременнаяТаблицаШапка.Услуга КАК Услуга,
		|	ВременнаяТаблицаШапка.ВидОперации
		|ИЗ
		|	ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|ГДЕ
		|	ВременнаяТаблицаШапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоступлениеНаСчет.РасчетыПоСубсидиям)";	
		
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаВзаиморасчетыПоСубсидиям", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаВзаиморасчетыПоСубсидиям()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаВзаиморасчетыПоРегиональнымСубсидиям(ДокументСсылкаПоступлениеНаСчет, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		|	ВременнаяТаблицаШапка.Период КАК Период,
		|	ВременнаяТаблицаШапка.Организация КАК Организация,
		|	ВременнаяТаблицаШапка.Контрагент КАК Контрагент,
		|	ВременнаяТаблицаШапка.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	ВременнаяТаблицаШапка.СуммаДокумента КАК Сумма,
		|	ВременнаяТаблицаШапка.Услуга КАК Услуга,
		|	ВременнаяТаблицаШапка.ВидОперации
		|ИЗ
		|	ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|ГДЕ
		|	ВременнаяТаблицаШапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоступлениеНаСчет.РасчетыПоРегиональнымСубсидиям)";	
		
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаВзаиморасчетыПоРегиональнымСубсидиям", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаВзаиморасчетыПоСубсидиям()


Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаПоступлениеНаСчет, СтруктураДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПоступлениеНаСчетРасшифровкаПлатежа.Ссылка.Дата КАК Период,
		|	ПоступлениеНаСчетРасшифровкаПлатежа.Ссылка.Организация,
		|	ПоступлениеНаСчетРасшифровкаПлатежа.Ссылка.ЛицевойСчет,
		|	ПоступлениеНаСчетРасшифровкаПлатежа.Услуга,
		|	ПоступлениеНаСчетРасшифровкаПлатежа.МесяцНачисления,
		|	ПоступлениеНаСчетРасшифровкаПлатежа.Сумма,
		|	ПоступлениеНаСчетРасшифровкаПлатежа.Ссылка.ВидОперации,
		|	ПоступлениеНаСчетРасшифровкаПлатежа.Ссылка.ВидНачисления
		|ПОМЕСТИТЬ ВременнаяТаблицаРасшифровкаПлатежа
		|ИЗ
		|	Документ.ПоступлениеНаСчет.РасшифровкаПлатежа КАК ПоступлениеНаСчетРасшифровкаПлатежа
		|ГДЕ
		|	ПоступлениеНаСчетРасшифровкаПлатежа.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПоступлениеНаСчет.Организация,
		|	ПоступлениеНаСчет.ВидОперации,
		|	ПоступлениеНаСчет.БанковскийСчет,
		|	ПоступлениеНаСчет.Контрагент,
		|	ПоступлениеНаСчет.ДоговорКонтрагента,
		|	ПоступлениеНаСчет.ЛицевойСчет,
		|	ПоступлениеНаСчет.СуммаДокумента,
		|	ПоступлениеНаСчет.Дата КАК Период,
		|	ПоступлениеНаСчет.Услуга
		|ПОМЕСТИТЬ ВременнаяТаблицаШапка
		|ИЗ
		|	Документ.ПоступлениеНаСчет КАК ПоступлениеНаСчет
		|ГДЕ
		|	ПоступлениеНаСчет.Ссылка = &Ссылка";
	 
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаПоступлениеНаСчет);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СформироватьТаблицуРасчетыПоЛицевымСчетам(ДокументСсылкаПоступлениеНаСчет, СтруктураДополнительныеСвойства);
	СформироватьТаблицуДенежныеСредства(ДокументСсылкаПоступлениеНаСчет, СтруктураДополнительныеСвойства);	
	СформироватьТаблицаВзаиморасчетыПоСубсидиям(ДокументСсылкаПоступлениеНаСчет, СтруктураДополнительныеСвойства);
	СформироватьТаблицаВзаиморасчетыПоЛьготам(ДокументСсылкаПоступлениеНаСчет, СтруктураДополнительныеСвойства);
	СформироватьТаблицаВзаиморасчетыПоРегиональнымСубсидиям(ДокументСсылкаПоступлениеНаСчет, СтруктураДополнительныеСвойства);
	
КонецПроцедуры

// Контроль раздела учета ДенежныеСредства.
//
Процедура ВыполнитьКонтроль(ДокументСсылкаПоступлениеНаСчет, ДополнительныеСвойства, Отказ, УдалениеПроведения = Ложь) Экспорт
	
	Если Не ПроведениеСервер.ВыполнитьКонтрольОстатков() Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураВременныеТаблицы = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы;
	
	// Если временные таблицы "ДвиженияДенежныеСредстваИзменение"
	// содержат записи, необходимо выполнить контроль отрицательных остатков.
	
	Если СтруктураВременныеТаблицы.ДвиженияДенежныеСредстваИзменение или
		СтруктураВременныеТаблицы.ДвиженияРасчетыПоЛицевымСчетамИзменение Тогда
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ДвиженияДенежныеСредстваИзменение.НомерСтроки КАК НомерСтроки,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияДенежныеСредстваИзменение.Организация) КАК ОрганизацияПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияДенежныеСредстваИзменение.БанковскийСчетКасса) КАК БанковскийСчетКассаПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияДенежныеСредстваИзменение.ТипДенежныхСредств) КАК ТипДенежныхСредствПредставление,
		|	ДвиженияДенежныеСредстваИзменение.ТипДенежныхСредств КАК ТипДенежныхСредств,
		|	ЕСТЬNULL(ДенежныеСредстваОстатки.СуммаОстаток, 0) КАК СуммаОстаток,
		|	ДвиженияДенежныеСредстваИзменение.СуммаИзменение + ЕСТЬNULL(ДенежныеСредстваОстатки.СуммаОстаток, 0) КАК ОстатокДенежныхСредств,
		|	ДвиженияДенежныеСредстваИзменение.СуммаПередЗаписью КАК СуммаПередЗаписью,
		|	ДвиженияДенежныеСредстваИзменение.СуммаПриЗаписи КАК СуммаПриЗаписи,
		|	ДвиженияДенежныеСредстваИзменение.СуммаИзменение КАК СуммаИзменение
		|ИЗ
		|	ДвиженияДенежныеСредстваИзменение КАК ДвиженияДенежныеСредстваИзменение
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ДенежныеСредства.Остатки(
		|				&МоментКонтроля,
		|				(Организация, ТипДенежныхСредств, БанковскийСчетКасса) В
		|					(ВЫБРАТЬ
		|						ДвиженияДенежныеСредстваИзменение.Организация КАК Организация,
		|						ДвиженияДенежныеСредстваИзменение.ТипДенежныхСредств КАК ТипДенежныхСредств,
		|						ДвиженияДенежныеСредстваИзменение.БанковскийСчетКасса КАК БанковскийСчетКасса
		|					ИЗ
		|						ДвиженияДенежныеСредстваИзменение КАК ДвиженияДенежныеСредстваИзменение)) КАК ДенежныеСредстваОстатки
		|		ПО ДвиженияДенежныеСредстваИзменение.Организация = ДенежныеСредстваОстатки.Организация
		|			И ДвиженияДенежныеСредстваИзменение.ТипДенежныхСредств = ДенежныеСредстваОстатки.ТипДенежныхСредств
		|			И ДвиженияДенежныеСредстваИзменение.БанковскийСчетКасса = ДенежныеСредстваОстатки.БанковскийСчетКасса
		|ГДЕ
		|	ЕСТЬNULL(ДенежныеСредстваОстатки.СуммаОстаток, 0) < 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДвиженияРасчетыПоЛицевымСчетамИзменение.НомерСтроки КАК НомерСтроки,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияРасчетыПоЛицевымСчетамИзменение.Организация) КАК ОрганизацияПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияРасчетыПоЛицевымСчетамИзменение.ЛицевойСчет) КАК ЛицевойСчетПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияРасчетыПоЛицевымСчетамИзменение.Услуга) КАК УслугаПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияРасчетыПоЛицевымСчетамИзменение.МесяцНачисления) КАК МесяцНачисленияПредставление,
		|	ЕСТЬNULL(ДвиженияРасчетыПоЛицевымСчетамИзменение.СуммаИзменение, 0) + ЕСТЬNULL(РасчетыПоЛицевымСчетамОстатки.СуммаОстаток, 0) КАК ОстатокРасчетыПоЛицевымСчетам,
		|	ЕСТЬNULL(РасчетыПоЛицевымСчетамОстатки.СуммаОстаток, 0) КАК СуммаОстатокРасчетыПоЛицевымСчетам
		|ИЗ
		|	ДвиженияРасчетыПоЛицевымСчетамИзменение КАК ДвиженияРасчетыПоЛицевымСчетамИзменение
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыПоЛицевымСчетам.Остатки(
		|				&МоментКонтроля,
		|				(Организация, ЛицевойСчет, Услуга, МесяцНачисления) В
		|					(ВЫБРАТЬ
		|						ДвиженияРасчетыПоЛицевымСчетамИзменение.Организация КАК Организация,
		|						ДвиженияРасчетыПоЛицевымСчетамИзменение.ЛицевойСчет КАК ЛицевойСчет,
		|						ДвиженияРасчетыПоЛицевымСчетамИзменение.Услуга КАК Услуга,
		|						ДвиженияРасчетыПоЛицевымСчетамИзменение.МесяцНачисления КАК МесяцНачисления
		|					ИЗ
		|						ДвиженияРасчетыПоЛицевымСчетамИзменение КАК ДвиженияРасчетыПоЛицевымСчетамИзменение)) КАК РасчетыПоЛицевымСчетамОстатки
		|		ПО ДвиженияРасчетыПоЛицевымСчетамИзменение.Организация = РасчетыПоЛицевымСчетамОстатки.Организация
		|			И ДвиженияРасчетыПоЛицевымСчетамИзменение.ЛицевойСчет = РасчетыПоЛицевымСчетамОстатки.ЛицевойСчет
		|			И ДвиженияРасчетыПоЛицевымСчетамИзменение.Услуга = РасчетыПоЛицевымСчетамОстатки.Услуга
		|			И ДвиженияРасчетыПоЛицевымСчетамИзменение.МесяцНачисления = РасчетыПоЛицевымСчетамОстатки.МесяцНачисления
		|ГДЕ
		|	ЕСТЬNULL(РасчетыПоЛицевымСчетамОстатки.СуммаОстаток, 0) < 0
		|	И РасчетыПоЛицевымСчетамОстатки.МесяцНачисления <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|	И ДвиженияРасчетыПоЛицевымСчетамИзменение.МесяцНачисления <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки");
		
		Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		Запрос.УстановитьПараметр("МоментКонтроля", ДополнительныеСвойства.ДляПроведения.МоментКонтроля);
		
		МассивРезультатов = Запрос.ВыполнитьПакет();
		
		Если НЕ МассивРезультатов[0].Пустой()
			ИЛИ НЕ МассивРезультатов[1].Пустой() Тогда
			ДокументОбъектПоступлениеНаСчет = ДокументСсылкаПоступлениеНаСчет.ПолучитьОбъект();
		КонецЕсли;
		
		// Отрицательный остаток по денежным средствам.
		Если НЕ МассивРезультатов[0].Пустой() Тогда
			ВыборкаИзРезультатаЗапроса = МассивРезультатов[0].Выбрать();
			ОСМДСервер.СообщитьОбОшибкахПроведенияПоРегиструДенежныеСредства(ДокументОбъектПоступлениеНаСчет, ВыборкаИзРезультатаЗапроса, Отказ);
		КонецЕсли;
		
		Если НЕ МассивРезультатов[1].Пустой() Тогда
			ВыборкаИзРезультатаЗапроса = МассивРезультатов[1].Выбрать();
			ОСМДСервер.СообщитьОбОшибкахПроведенияПоРегиструРасчетыПоЛицевымСчетамСписком(ДокументОбъектПоступлениеНаСчет, ВыборкаИзРезультатаЗапроса, Отказ);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
